* Making it nicer
** PROJECT Better logo																											   :PROJECT:
*** TODO "Bunny Doors" text (in MC font) on the bottom
** PROJECT fix HTML export of Org
*** TODO Different Pages per section 
*** TODO Readme.html that is simple, contains video, and link to ghpages
*** TODO http://oli.jp/2011/github-pages-workflow/ ... automagic push of master to gh-pages...?

** PROJECT Documentation
*** PROJECT User Documentation
**** FINISHED [[./Readme.org]] Primary Readme for github an bukkit dev
	 CLOSED: [2012-02-02 Thu 12:49]
***** DONE Preamble
	  CLOSED: [2012-02-02 Thu 12:49]
	  - What it does in a nutshell
	  - Some cool things you can do with it.
***** DONE Links
	  CLOSED: [2012-02-02 Thu 12:49]
*** FINISHED [[./doc/Quickstart.org]] Quickstart
	 CLOSED: [2012-02-02 Thu 12:49]
	
**** DONE Installing
	 CLOSED: [2012-02-01 Wed 13:45]
**** DONE Adding a key
	 CLOSED: [2012-02-01 Wed 13:45]
**** DONE Adding a key to a user
	 CLOSED: [2012-02-01 Wed 13:45]
**** DONE Locking a door
	 CLOSED: [2012-02-01 Wed 13:45]
**** DONE Unlocking a door
	 CLOSED: [2012-02-01 Wed 13:45]
*** PROJECT [[./doc/Config.org]] Config
*** PROJECT [[./doc/Commands.org]] Commands
*** PROJECT [[./doc/Permissions.org]] Permissions 
*** PROJECT [[./doc/Roadmap.org]] Roadmap
*** PROJECT [[./doc/Dev.org]] Developer Documentation 																				   :PROJECT:
** PROJECT Video 
* Future Versions [[./doc/Roadmap.org]]
** FINISHED 0.1 Release
   CLOSED: [2012-01-29 Sun 19:38]
*** FINISHED Outputs data to the console when a user uses a door
	 CLOSED: [2012-01-29 Sun 15:29]
	- Some kind of door identifier 
	- location of door (if needed)
	  Interacting with doors isn't well documented, thank god for LWC
	  https://github.com/Hidendra/LWC/tree/master/src/main/java/com/griefcraft/listeners
	  https://github.com/Hidendra/LWC/blob/master/src/main/java/com/griefcraft/util/matchers/DoorMatcher.java
*** FINISHED Set up a command ~/bunnydoor info~ Outputs to the console the door that the user is looking at
	 CLOSED: [2012-01-29 Sun 19:38]

** FINISHED 0.2 Release
   CLOSED: [2012-01-30 Mon 23:03]
*** FINISHED Doors have both blocks.  Need to refer to bottom only when testing.
	 CLOSED: [2012-01-30 Mon 23:03]
**** TODO Fix the id block problem.  More debug code around it
*** FINISHED test permissions to lock and unlock doors
	 CLOSED: [2012-01-30 Mon 23:03]
*** FINISHED fix permission to open doxoors
	 CLOSED: [2012-01-30 Mon 23:03]
*** FINISHED If a door is locked, it should say it is locked
	 CLOSED: [2012-01-30 Mon 23:03]
*** FINISHED Devilstats? sure why not
	 CLOSED: [2012-01-29 Sun 23:29]
**** DONE Compile
	 CLOSED: [2012-01-29 Sun 23:29]
*** DONE 3 Basic permission nodes: (With a nod to the Dragon Quest series)
	 CLOSED: [2012-01-29 Sun 21:30]
	   - ~door.key.thiefkey~
	   - ~door.key.magickey~
	   - ~door.key.finalkey~
*** FINISHED Storage of door properties inside of a yml file
	 CLOSED: [2012-01-29 Sun 23:40]
**** DONE Reload Configs command
	 CLOSED: [2012-01-29 Sun 23:40]
**** DONE Save configs command
	 CLOSED: [2012-01-29 Sun 23:40]
**** DONE Save config on disable
	 CLOSED: [2012-01-29 Sun 23:40]
*** FINISHED ~/bunnydoor lock <key>~ locks the door with the given key (i.e. thiefkey, magickey, finalkey)
	 CLOSED: [2012-01-29 Sun 23:41]
**** DONE Add command
	 CLOSED: [2012-01-29 Sun 23:41]
**** DONE Store door
	 CLOSED: [2012-01-29 Sun 23:41]
*** FINISHED Actually prevent users from using a door when they don't have a key, and give them a message.
	 CLOSED: [2012-01-29 Sun 23:41]
*** FINISHED Reload not working
	 CLOSED: [2012-01-30 Mon 00:54]

** FINISHED 0.3 Release
   CLOSED: [2012-01-31 Tue 00:12]
*** FINISHED key command
	 CLOSED: [2012-01-31 Tue 00:03]
	/key list
    /key listall 
    /key give <player> <name>
*** FINISHED Locked doors automagically close themselves
	 CLOSED: [2012-01-31 Tue 00:03]
    Bukkit.getServer().getScheduler().scheduleSyncDelayedTask(plugin, new Runnable()
        {
            public void run()
            {
                do stuff in here
            }
        }, # of ticks delayed here);
*** FINISHED /bunnykey add <key>
	 CLOSED: [2012-01-31 Tue 00:00]
*** FINISHED /bunnykey list <key> the User should be able to list the keys
	 CLOSED: [2012-01-30 Mon 23:03]
** FINISHED 0.4 Release
   CLOSED: [2012-02-01 Wed 01:58]
*** FINISHED /bunnykey give <key> <player>
	 CLOSED: [2012-02-01 Wed 01:41]
	net.milkbowl.vault.permission.playerAdd(Player player, String permission)
**** TODO Test 
*** FINISHED Better door info
	 CLOSED: [2012-02-01 Wed 01:57]
**** TODO Fix the player 
**** TODO query if it is a bunnydoor door
*** FINISHED Choose whether or not to do devil stats in the config.
	 CLOSED: [2012-02-01 Wed 01:41]
**** TODO Test 
*** FINISHED Fixed bad door close bug, where the top half of the door would turn into the bottom half
*** FINISHED Fixed horrible permissions issue where /bunnykeys was accessible to everyone.
** FINISHED 0.5 - Spout release!
   CLOSED: [2012-02-06 Mon 11:50]
*** DONE Plugin permissions in plugin.yaml
	 CLOSED: [2012-02-06 Mon 11:50]
** PROJECT 0.6
*** PROJECT Chests
**** TODO test protection of chests
**** TODO Test keys inside chests
***** TODO add debug
**** TODO Fix info to only infoize if it can cast
** PROJECT 0.7
*** PROJECT Single use keys
**** TODO Update default config to set options
**** TODO Add Item node to key 

in config
parseInt(configval) 
catch NumberFormatException e

**** TODO add GOLD_RECORD, GREEN_RECORD, RECORD_3 -> RECORD_11 to default config, note about how ids or names ar fine
    Other possibilitites  (see http://www.minecraftwiki.net/wiki/Data_values#Block_IDs_.28Minecraft_Official_Release.29 and choose a red value)
	- REDSTONE_TORCH_OFF
	- PISTON_EXTENSION
	- PISTON_MOVING_PIECE
	- FIRE
	- DEAD_BUSH
	- STATIONARY_WATER
	- STATIONARY_LAVA
	- REDSTONE_WIRE (55)
	- FARMLAND (60)
	- SUGAR_CANE (83)
	- 
**** TODO remove key if in hand
// ItemStack stack = player.getInventory().getItemInHand();
// inventory.removeItem(new ItemStack (Mat, Int))  --> perdog http://forums.bukkit.org/threads/removing-items-from-inventories.49387/

*** PROJECT Players grant specific keys with bunnydoor.keymaster.<key> permission
*** PROJECT Trap Doors

*** PROJECT Iron Door opening, block-based-key
** PROJECT 0.8 Integration release
*** PROJECT when a door is modified it should throw event
	- remove changed doors from queue 
*** PROJECT when a locked door is attempted, throw an event 

** PROJECT 0.9 Optimization release
*** PROJECT Set up DB persistence 

** PROJECT 1.0 Fix bugs from previous releases
* Test
** Run
#+begin_src emacs-lisp 
(save-excursion
 (set-buffer "Readme.org")
 (let ((fill-column 80))
   (org-babel-tangle)
   (org-export-as-ascii 3))
 ;(let ((fill-column 9999))
 ;  (org-export-as-html 2 nil nil nil 1))
)
 
(mcstat-run-minecraft)
(pop-to-buffer "*mcstat-mc*")
#+end_src

#+results:
  
** Acceptence Tests
   - [ ] All Pass?
     - [ ] Main Plugin 
	   - [ ] Config file saved in location?
	   - [ ] Serialized Door file saved? (does it need to?
	 - [ ] Command
	   - [ ] From Console 
		 - [ ] Help command works, returns valid commands
		 - [ ] Lock
		   - [ ] console returns error
		   - [ ] no key arg returns error
		   - [ ] invalid key returns error and key list
		 - [ ] Unlock
		   - [ ] console returns error
		 - [ ] Info
		   - [ ] Console returns error
		 - [ ] reload
		   - [ ] reload doesn't error
		   - [ ] reload returns new key list (use lock invalid)
	 - [ ] With Player
	   - [ ] Lock door
		 - [ ] Open locked door fails
		 - [ ] Succeeds with key perm
	   - [ ] Unlock Door


** Server Test
#+begin_src sh
scp -v target/BunnyDoors.jar jonny@70.75.70.233:/usr/local/minecraft/server/plugins/
#+end_src

#+results:

* Build

#+begin_src sh :results output
mvn install
cp -v target/BunnyDoors.jar ../mineCraftStatus/server/plugins/
#+end_src

#+results:
#+begin_example
[INFO] Scanning for projects...
[INFO]                                                                         
[INFO] ------------------------------------------------------------------------
[INFO] Building Bunny Doors 0.6.0
[INFO] ------------------------------------------------------------------------
Downloading: http://repo.bukkit.org/content/groups/public/org/getspout/spoutpluginapi/dev-SNAPSHOT/maven-metadata.xml
Downloading: http://repo.getspout.org/org/getspout/spoutpluginapi/dev-SNAPSHOT/maven-metadata.xml
773 B                   Downloaded: http://repo.getspout.org/org/getspout/spoutpluginapi/dev-SNAPSHOT/maven-metadata.xml (773 B at 1.0 KB/sec)
Downloading: http://repo.bukkit.org/content/groups/public/org/getspout/spoutpluginapi/dev-SNAPSHOT/spoutpluginapi-dev-20120206.233411-22.pom
        Downloading: http://repo.getspout.org/org/getspout/spoutpluginapi/dev-SNAPSHOT/spoutpluginapi-dev-20120206.233411-22.pom
3 KB    4 KB          Downloaded: http://repo.getspout.org/org/getspout/spoutpluginapi/dev-SNAPSHOT/spoutpluginapi-dev-20120206.233411-22.pom (4 KB at 6.0 KB/sec)
Downloading: http://repo.getspout.org/org/getspout/spoutpluginapi/dev-SNAPSHOT/spoutpluginapi-dev-20120206.233411-22.jar
3 KB   4 KB   6 KB   7 KB   9 KB   10 KB   11 KB   13 KB   14 KB   16 KB   17 KB   18 KB   20 KB   21 KB   23 KB   24 KB   25 KB   27 KB   28 KB   30 KB   31 KB   33 KB   34 KB   35 KB   37 KB   38 KB   40 KB   41 KB   42 KB   44 KB   45 KB   47 KB   48 KB   50 KB   51 KB   52 KB   54 KB   55 KB   57 KB   58 KB   59 KB   61 KB   62 KB   64 KB   65 KB   66 KB   68 KB   69 KB   71 KB   72 KB   74 KB   75 KB   76 KB   78 KB   79 KB   81 KB   82 KB   83 KB   85 KB   86 KB   88 KB   89 KB   91 KB   92 KB   93 KB   95 KB   96 KB   98 KB   99 KB   100 KB   102 KB   103 KB   105 KB   106 KB   107 KB   109 KB   110 KB   112 KB   113 KB   115 KB   116 KB   117 KB   119 KB   120 KB   122 KB   123 KB   124 KB   126 KB   127 KB   129 KB   130 KB   132 KB   133 KB   134 KB   136 KB   137 KB   139 KB   140 KB   141 KB   143 KB   144 KB   146 KB   147 KB   149 KB   150 KB   151 KB   153 KB   154 KB   156 KB   157 KB   158 KB   160 KB   161 KB   163 KB   164 KB   165 KB   167 KB   168 KB   170 KB   171 KB   173 KB   174 KB   175 KB   177 KB   178 KB   180 KB   181 KB   182 KB   184 KB   185 KB   187 KB   188 KB   190 KB   191 KB   192 KB   194 KB   195 KB   197 KB   198 KB   199 KB   201 KB   202 KB   204 KB   205 KB   206 KB   208 KB   209 KB   211 KB   212 KB   214 KB   215 KB   216 KB   218 KB   219 KB   221 KB   222 KB   223 KB   225 KB   226 KB   228 KB   229 KB   231 KB   232 KB   233 KB   235 KB   236 KB   238 KB   239 KB   240 KB   242 KB   243 KB   245 KB   246 KB   247 KB   249 KB   250 KB   252 KB   253 KB   255 KB   256 KB   257 KB   259 KB   260 KB   262 KB   263 KB   264 KB   266 KB   267 KB   269 KB   270 KB   272 KB   273 KB   274 KB   276 KB   277 KB   279 KB   280 KB   281 KB   283 KB   284 KB   286 KB   287 KB   288 KB   290 KB   291 KB   293 KB   294 KB   296 KB   297 KB   298 KB   300 KB   301 KB   303 KB   304 KB   305 KB   307 KB   308 KB   310 KB   311 KB   313 KB   314 KB   315 KB   317 KB   318 KB   320 KB   321 KB   322 KB   324 KB   325 KB   327 KB   328 KB   330 KB   331 KB   332 KB   334 KB   335 KB   337 KB   338 KB   339 KB   341 KB   342 KB   344 KB   345 KB   346 KB   348 KB   349 KB   351 KB   352 KB   354 KB   355 KB   356 KB   358 KB   359 KB   361 KB   362 KB   363 KB   365 KB   366 KB   368 KB   369 KB   371 KB   372 KB   373 KB   375 KB   376 KB   378 KB   379 KB   380 KB   382 KB   383 KB   385 KB   386 KB   387 KB   389 KB   390 KB   392 KB   393 KB   395 KB   396 KB   397 KB   399 KB   400 KB   402 KB   403 KB   404 KB   406 KB   407 KB   409 KB   410 KB   412 KB   413 KB   414 KB   416 KB   417 KB   419 KB   420 KB   421 KB   423 KB   424 KB   426 KB   427 KB   428 KB   430 KB   431 KB   433 KB   434 KB   436 KB   437 KB   438 KB   440 KB   441 KB   443 KB   444 KB   445 KB   447 KB   448 KB   450 KB   451 KB   453 KB   454 KB   455 KB   457 KB   458 KB   460 KB   461 KB   462 KB   464 KB   465 KB   467 KB   468 KB   469 KB   471 KB   472 KB   474 KB   475 KB   477 KB   478 KB   479 KB   481 KB   482 KB   484 KB   485 KB   486 KB   488 KB   489 KB   491 KB   492 KB   494 KB   495 KB   496 KB   498 KB   499 KB   501 KB   502 KB   503 KB   505 KB   506 KB   508 KB   509 KB   511 KB   512 KB   513 KB   515 KB   516 KB   518 KB   519 KB   520 KB   522 KB   523 KB   525 KB   526 KB   527 KB   529 KB   530 KB   532 KB   533 KB   535 KB   536 KB   537 KB   539 KB   540 KB   542 KB   543 KB   544 KB   546 KB   547 KB   549 KB   550 KB   552 KB   553 KB   554 KB   556 KB   557 KB   559 KB   560 KB   561 KB   563 KB   564 KB   566 KB   567 KB   568 KB   570 KB   571 KB   573 KB   574 KB   576 KB   577 KB   578 KB   580 KB   581 KB   583 KB   584 KB   585 KB   587 KB   588 KB   590 KB   591 KB   593 KB   594 KB   595 KB   597 KB   598 KB   600 KB   601 KB   602 KB   604 KB   605 KB   607 KB   608 KB   609 KB   611 KB   612 KB   614 KB   615 KB   617 KB   618 KB   619 KB   621 KB   622 KB   626 KB   630 KB   634 KB   638 KB   642 KB   646 KB   650 KB   654 KB   658 KB   662 KB   666 KB   670 KB   674 KB   678 KB   682 KB   686 KB   690 KB   694 KB   698 KB   702 KB   706 KB   710 KB   714 KB   718 KB   722 KB   726 KB   730 KB   734 KB   738 KB   742 KB   746 KB   749 KB   751 KB   752 KB   756 KB   760 KB   764 KB   768 KB   772 KB   776 KB   780 KB   784 KB   788 KB   792 KB   796 KB   800 KB   804 KB   807 KB   809 KB   810 KB   812 KB   813 KB   815 KB   819 KB   823 KB   827 KB   831 KB   835 KB   839 KB   843 KB   847 KB   851 KB   855 KB   859 KB   863 KB   867 KB   871 KB   875 KB   879 KB   883 KB   887 KB   891 KB   895 KB   899 KB   903 KB   907 KB   911 KB   915 KB   919 KB   923 KB   927 KB   931 KB   935 KB   939 KB   943 KB   947 KB   951 KB   955 KB   959 KB   963 KB   967 KB   967 KB   969 KB   970 KB   971 KB   973 KB   974 KB   976 KB   977 KB   979 KB   980 KB   981 KB   983 KB   984 KB   986 KB   987 KB   988 KB   990 KB   991 KB   993 KB   994 KB   996 KB   997 KB   998 KB   1000 KB   1001 KB   1003 KB   1004 KB   1005 KB   1007 KB   1008 KB   1010 KB   1011 KB   1012 KB   1014 KB   1015 KB   1017 KB   1018 KB   1020 KB   1021 KB   1022 KB   1024 KB   1025 KB   1027 KB   1028 KB   1029 KB   1031 KB   1032 KB   1034 KB   1035 KB   1037 KB   1038 KB   1039 KB   1041 KB   1042 KB   1044 KB   1045 KB   1046 KB   1048 KB   1049 KB   1051 KB   1052 KB   1054 KB   1055 KB   1056 KB   1058 KB   1059 KB   1061 KB   1062 KB   1063 KB   1065 KB   1066 KB   1068 KB   1069 KB   1070 KB   1072 KB   1073 KB   1075 KB   1076 KB   1078 KB   1079 KB   1080 KB   1082 KB   1083 KB   1085 KB   1086 KB   1087 KB   1089 KB   1090 KB   1092 KB   1093 KB   1095 KB   1096 KB   1097 KB   1099 KB   1100 KB   1102 KB   1103 KB   1104 KB   1106 KB   1107 KB   1109 KB   1110 KB   1111 KB   1113 KB   1114 KB   1116 KB   1117 KB   1119 KB   1120 KB   1121 KB   1123 KB   1124 KB   1126 KB   1127 KB   1128 KB   1130 KB   1131 KB   1133 KB   1134 KB   1136 KB   1137 KB   1138 KB   1140 KB   1141 KB   1143 KB   1144 KB   1145 KB   1147 KB   1148 KB   1150 KB   1151 KB   1152 KB   1154 KB   1155 KB   1157 KB   1158 KB   1160 KB   1161 KB   1162 KB   1164 KB   1165 KB   1167 KB   1168 KB   1169 KB   1171 KB   1172 KB   1174 KB   1175 KB   1177 KB   1178 KB   1179 KB   1181 KB   1182 KB   1184 KB   1185 KB   1186 KB   1188 KB   1189 KB   1191 KB   1192 KB   1193 KB   1195 KB   1196 KB   1198 KB   1199 KB   1201 KB   1202 KB   1203 KB   1205 KB   1206 KB   1208 KB   1209 KB   1210 KB   1212 KB   1213 KB   1215 KB   1216 KB   1218 KB   1219 KB   1220 KB   1222 KB   1223 KB   1225 KB   1226 KB   1227 KB   1229 KB   1230 KB   1232 KB   1233 KB   1235 KB   1236 KB   1237 KB   1239 KB   1240 KB   1242 KB   1243 KB   1244 KB   1246 KB   1247 KB   1249 KB   1250 KB   1251 KB   1253 KB   1254 KB   1256 KB   1257 KB   1259 KB   1260 KB   1261 KB   1263 KB   1264 KB   1266 KB   1267 KB   1268 KB   1270 KB   1271 KB   1273 KB   1274 KB   1276 KB   1277 KB   1278 KB   1280 KB   1281 KB   1283 KB   1284 KB   1285 KB   1287 KB   1288 KB   1290 KB   1291 KB   1292 KB   1294 KB   1295 KB   1297 KB   1298 KB   1300 KB   1301 KB   1302 KB   1304 KB   1305 KB   1307 KB   1308 KB   1309 KB   1311 KB   1312 KB   1314 KB   1315 KB   1317 KB   1318 KB   1319 KB   1321 KB   1322 KB   1324 KB   1325 KB   1326 KB   1328 KB   1329 KB   1331 KB   1332 KB   1333 KB   1335 KB   1336 KB   1338 KB   1339 KB   1341 KB   1342 KB   1343 KB   1345 KB   1346 KB   1348 KB   1349 KB   1350 KB   1352 KB   1353 KB   1355 KB   1356 KB   1358 KB   1359 KB   1360 KB   1362 KB   1363 KB   1365 KB   1366 KB   1367 KB   1369 KB   1370 KB   1372 KB   1373 KB   1374 KB   1378 KB   1382 KB   1386 KB   1390 KB   1394 KB   1398 KB   1402 KB   1406 KB   1410 KB   1414 KB   1418 KB   1422 KB   1426 KB   1430 KB   1434 KB   1438 KB   1442 KB   1446 KB   1450 KB   1454 KB   1457 KB   1458 KB   1459 KB   1461 KB   1462 KB   1464 KB   1465 KB   1466 KB   1468 KB   1469 KB   1471 KB   1472 KB   1473 KB   1475 KB   1476 KB   1478 KB   1479 KB   1481 KB   1482 KB   1483 KB   1485 KB   1486 KB   1488 KB   1489 KB   1490 KB   1492 KB   1493 KB   1495 KB   1496 KB   1498 KB   1499 KB   1500 KB   1502 KB   1503 KB   1505 KB   1506 KB   1507 KB   1509 KB   1510 KB   1512 KB   1513 KB   1514 KB   1516 KB   1517 KB   1519 KB   1520 KB   1522 KB   1523 KB   1524 KB   1526 KB   1527 KB   1529 KB   1530 KB   1531 KB   1533 KB   1534 KB   1536 KB   1537 KB   1539 KB   1540 KB   1541 KB   1545 KB   1549 KB   1553 KB   1557 KB   1561 KB   1565 KB   1569 KB   1573 KB   1577 KB   1581 KB   1585 KB   1589 KB   1593 KB   1597 KB   1601 KB   1605 KB   1609 KB   1613 KB   1617 KB   1621 KB   1625 KB   1629 KB   1633 KB   1637 KB   1641 KB   1645 KB   1649 KB   1653 KB   1657 KB   1661 KB   1665 KB   1669 KB   1673 KB   1677 KB   1681 KB   1685 KB   1689 KB   1693 KB   1697 KB   1701 KB   1705 KB   1709 KB   1713 KB   1717 KB   1721 KB   1725 KB   1729 KB   1733 KB   1737 KB   1741 KB   1745 KB   1749 KB   1753 KB   1757 KB   1761 KB   1765 KB   1769 KB   1773 KB   1777 KB   1781 KB   1785 KB   1789 KB   1793 KB   1797 KB   1801 KB   1805 KB   1809 KB   1813 KB   1817 KB   1821 KB   1825 KB   1829 KB   1833 KB   1837 KB   1841 KB   1845 KB   1849 KB   1853 KB   1857 KB   1861 KB   1865 KB   1869 KB   1873 KB   1877 KB   1881 KB   1885 KB   1889 KB   1893 KB   1897 KB   1901 KB   1905 KB   1909 KB   1913 KB   1917 KB   1921 KB   1925 KB   1929 KB   1933 KB   1937 KB   1941 KB   1945 KB   1949 KB   1953 KB   1957 KB   1961 KB   1965 KB   1969 KB   1973 KB   1977 KB   1981 KB   1985 KB   1989 KB   1993 KB   1997 KB   2000 KB   2001 KB   2002 KB   2004 KB   2005 KB   2007 KB   2008 KB   2009 KB   2011 KB   2012 KB   2014 KB   2015 KB   2016 KB   2018 KB   2019 KB   2021 KB   2022 KB   2024 KB   2025 KB   2028 KB   2029 KB   2031 KB   2032 KB   2033 KB   2035 KB   2036 KB   2038 KB   2039 KB   2041 KB   2042 KB   2043 KB   2045 KB   2046 KB   2048 KB   2049 KB   2050 KB   2052 KB   2053 KB   2055 KB   2056 KB   2057 KB   2059 KB   2060 KB   2062 KB   2063 KB   2065 KB   2066 KB   2067 KB   2069 KB   2070 KB   2072 KB   2073 KB   2074 KB   2076 KB   2077 KB   2079 KB   2080 KB   2082 KB   2083 KB   2084 KB   2086 KB   2087 KB   2089 KB   2090 KB   2091 KB   2093 KB   2094 KB   2096 KB   2097 KB   2098 KB   2100 KB   2101 KB   2103 KB   2104 KB   2106 KB   2107 KB   2108 KB   2110 KB   2111 KB   2113 KB   2114 KB   2115 KB   2117 KB   2118 KB   2120 KB   2121 KB   2123 KB   2124 KB   2125 KB   2127 KB   2128 KB   2130 KB   2131 KB   2132 KB   2134 KB   2135 KB   2137 KB   2138 KB   2140 KB   2141 KB   2142 KB   2144 KB   2145 KB   2147 KB   2148 KB   2149 KB   2151 KB   2152 KB   2154 KB   2155 KB   2156 KB   2158 KB   2159 KB   2161 KB   2162 KB   2164 KB   2165 KB   2166 KB   2168 KB   2169 KB   2171 KB   2172 KB   2173 KB   2175 KB   2176 KB   2178 KB   2179 KB   2181 KB   2182 KB   2183 KB   2185 KB   2186 KB   2188 KB   2189 KB   2190 KB   2192 KB   2193 KB   2195 KB   2196 KB   2197 KB   2199 KB   2200 KB   2202 KB   2203 KB   2205 KB   2206 KB   2207 KB   2209 KB   2210 KB   2212 KB   2213 KB   2214 KB   2216 KB   2217 KB   2219 KB   2220 KB   2222 KB   2223 KB   2224 KB   2226 KB   2227 KB   2229 KB   2230 KB   2231 KB   2233 KB   2234 KB   2236 KB   2237 KB   2238 KB   2240 KB   2241 KB   2243 KB   2244 KB   2246 KB   2247 KB   2248 KB   2250 KB   2251 KB   2253 KB   2254 KB   2255 KB   2257 KB   2258 KB   2260 KB   2261 KB   2263 KB   2264 KB   2265 KB   2267 KB   2268 KB   2270 KB   2271 KB   2272 KB   2274 KB   2275 KB   2277 KB   2278 KB   2279 KB   2281 KB   2282 KB   2284 KB   2285 KB   2287 KB   2288 KB   2289 KB   2291 KB   2292 KB   2294 KB   2295 KB   2296 KB   2298 KB   2299 KB   2301 KB   2302 KB   2304 KB   2305 KB   2306 KB   2308 KB   2309 KB   2311 KB   2312 KB   2313 KB   2315 KB   2316 KB   2318 KB   2319 KB   2321 KB   2322 KB   2323 KB   2325 KB   2326 KB   2328 KB   2329 KB   2330 KB   2332 KB   2333 KB   2335 KB   2336 KB   2337 KB   2339 KB   2340 KB   2342 KB   2343 KB   2345 KB   2346 KB   2347 KB   2349 KB   2350 KB   2352 KB   2353 KB   2354 KB   2356 KB   2357 KB   2359 KB   2360 KB   2362 KB   2363 KB   2364 KB   2366 KB   2367 KB   2369 KB   2370 KB   2371 KB   2373 KB   2374 KB   2376 KB   2377 KB   2378 KB   2380 KB   2381 KB   2383 KB   2384 KB   2386 KB   2387 KB   2388 KB   2390 KB   2391 KB   2393 KB   2394 KB   2395 KB   2397 KB   2398 KB   2400 KB   2401 KB   2403 KB   2404 KB   2405 KB   2407 KB   2408 KB   2410 KB   2411 KB   2412 KB   2414 KB   2415 KB   2417 KB   2418 KB   2419 KB   2421 KB   2422 KB   2424 KB   2425 KB   2427 KB   2428 KB   2429 KB   2431 KB   2432 KB   2434 KB   2435 KB   2436 KB   2438 KB   2439 KB   2441 KB   2442 KB   2444 KB   2445 KB   2446 KB   2448 KB   2449 KB   2451 KB   2452 KB   2453 KB   2455 KB   2456 KB   2458 KB   2459 KB   2460 KB   2462 KB   2463 KB   2465 KB   2466 KB   2468 KB   2469 KB   2470 KB   2472 KB   2473 KB   2475 KB   2476 KB   2477 KB   2479 KB   2480 KB   2482 KB   2483 KB   2485 KB   2486 KB   2487 KB   2489 KB   2490 KB   2492 KB   2493 KB   2494 KB   2496 KB   2497 KB   2499 KB   2500 KB   2502 KB   2503 KB   2504 KB   2506 KB   2507 KB   2509 KB   2510 KB   2511 KB   2513 KB   2514 KB   2516 KB   2517 KB   2518 KB   2520 KB   2521 KB   2523 KB   2524 KB   2526 KB   2527 KB   2528 KB   2530 KB   2531 KB   2533 KB   2534 KB   2535 KB   2537 KB   2538 KB   2540 KB   2541 KB   2543 KB   2544 KB   2545 KB   2547 KB   2548 KB   2550 KB   2551 KB   2552 KB   2554 KB   2555 KB   2557 KB   2558 KB   2559 KB   2561 KB   2562 KB   2564 KB   2565 KB   2567 KB   2568 KB   2569 KB   2571 KB   2572 KB   2574 KB   2575 KB   2576 KB   2578 KB   2579 KB   2581 KB   2582 KB   2584 KB   2585 KB   2586 KB   2588 KB   2589 KB   2591 KB   2592 KB   2593 KB   2595 KB   2596 KB   2598 KB   2599 KB   2600 KB   2602 KB   2603 KB   2605 KB   2606 KB   2608 KB   2609 KB   2610 KB   2612 KB   2613 KB   2615 KB   2616 KB   2617 KB   2619 KB   2620 KB   2622 KB   2623 KB   2625 KB   2626 KB   2627 KB   2629 KB   2630 KB   2632 KB   2633 KB   2634 KB   2636 KB   2637 KB   2639 KB   2640 KB   2641 KB   2643 KB   2644 KB   2646 KB   2647 KB   2649 KB   2650 KB   2651 KB   2653 KB   2654 KB   2656 KB   2657 KB   2658 KB   2660 KB   2661 KB   2663 KB   2664 KB   2666 KB   2667 KB   2668 KB   2670 KB   2671 KB   2673 KB   2674 KB   2675 KB   2677 KB   2678 KB   2680 KB   2681 KB   2683 KB   2684 KB   2685 KB   2687 KB   2688 KB   2690 KB   2691 KB   2692 KB   2694 KB   2695 KB   2697 KB   2698 KB   2699 KB   2701 KB   2702 KB   2704 KB   2705 KB   2707 KB   2708 KB   2709 KB   2711 KB   2712 KB   2714 KB   2715 KB   2716 KB   2718 KB   2719 KB   2721 KB   2722 KB   2724 KB   2725 KB   2726 KB   2728 KB   2729 KB   2731 KB   2732 KB   2733 KB   2735 KB   2736 KB   2738 KB   2739 KB   2740 KB   2742 KB   2743 KB   2745 KB   2746 KB   2748 KB   2749 KB   2750 KB   2752 KB   2753 KB   2755 KB   2756 KB   2757 KB   2759 KB   2760 KB   2762 KB   2763 KB   2765 KB   2766 KB   2767 KB   2769 KB   2770 KB   2772 KB   2773 KB   2774 KB   2776 KB   2777 KB   2779 KB   2780 KB   2781 KB   2783 KB   2784 KB   2786 KB   2787 KB   2789 KB   2790 KB   2791 KB   2793 KB   2794 KB   2796 KB   2797 KB   2798 KB   2800 KB   2801 KB   2803 KB   2804 KB   2806 KB   2807 KB   2808 KB   2810 KB   2811 KB   2813 KB   2814 KB   2815 KB   2817 KB   2818 KB   2820 KB   2821 KB   2822 KB   2824 KB   2825 KB   2827 KB   2828 KB   2830 KB   2831 KB   2832 KB   2834 KB   2835 KB   2837 KB   2838 KB   2839 KB   2841 KB   2842 KB   2844 KB   2845 KB   2847 KB   2848 KB   2849 KB   2851 KB   2852 KB   2854 KB   2855 KB   2856 KB   2858 KB   2859 KB   2861 KB   2862 KB   2864 KB   2865 KB   2866 KB   2868 KB   2869 KB   2871 KB   2872 KB   2873 KB   2875 KB   2876 KB   2878 KB   2879 KB   2880 KB   2882 KB   2883 KB   2885 KB   2886 KB   2888 KB   2889 KB   2890 KB   2892 KB   2893 KB   2895 KB   2896 KB   2897 KB   2899 KB   2900 KB   2902 KB   2903 KB   2905 KB   2906 KB   2907 KB   2909 KB   2910 KB   2912 KB   2913 KB   2914 KB   2916 KB   2917 KB   2919 KB   2920 KB   2921 KB   2923 KB   2924 KB   2926 KB   2927 KB   2929 KB   2930 KB   2931 KB   2933 KB   2934 KB   2936 KB   2937 KB   2938 KB   2940 KB   2941 KB   2943 KB   2944 KB   2946 KB   2947 KB   2948 KB   2950 KB   2951 KB   2953 KB   2954 KB   2955 KB   2957 KB   2958 KB   2960 KB   2961 KB   2962 KB   2964 KB   2965 KB   2967 KB   2968 KB   2970 KB   2971 KB   2972 KB   2974 KB   2975 KB   2977 KB   2978 KB   2979 KB   2981 KB   2982 KB   2984 KB   2985 KB   2987 KB   2988 KB   2989 KB   2991 KB   2992 KB   2994 KB   2995 KB   2996 KB   2998 KB   2999 KB   3001 KB   3002 KB   3003 KB   3005 KB   3006 KB   3008 KB   3009 KB   3011 KB   3012 KB   3013 KB   3015 KB   3016 KB   3018 KB   3019 KB   3020 KB   3022 KB   3023 KB   3025 KB   3026 KB   3028 KB   3029 KB   3030 KB   3032 KB   3033 KB   3035 KB   3036 KB   3037 KB   3041 KB   3045 KB   3049 KB   3053 KB   3057 KB   3061 KB   3065 KB   3069 KB   3073 KB   3077 KB   3081 KB   3083 KB   3084 KB   3086 KB   3087 KB   3088 KB   3090 KB   3091 KB   3093 KB   3094 KB   3095 KB   3097 KB   3098 KB   3100 KB   3101 KB   3102 KB   3104 KB   3105 KB   3107 KB   3108 KB   3110 KB   3111 KB   3112 KB   3114 KB   3115 KB   3117 KB   3118 KB   3119 KB   3121 KB   3122 KB   3124 KB   3125 KB   3127 KB   3128 KB   3129 KB   3131 KB   3132 KB   3134 KB   3135 KB   3136 KB   3138 KB   3139 KB   3141 KB   3142 KB   3143 KB   3145 KB   3146 KB   3148 KB   3149 KB   3151 KB   3152 KB   3153 KB   3155 KB   3156 KB   3158 KB   3159 KB   3160 KB   3162 KB   3163 KB   3165 KB   3166 KB   3168 KB   3169 KB   3170 KB   3172 KB   3173 KB   3175 KB   3176 KB   3177 KB   3179 KB   3180 KB   3182 KB   3183 KB   3184 KB   3186 KB   3187 KB   3189 KB   3190 KB   3192 KB   3193 KB   3194 KB   3196 KB   3197 KB   3199 KB   3200 KB   3201 KB   3203 KB   3204 KB   3206 KB   3207 KB   3209 KB   3210 KB   3211 KB   3213 KB   3214 KB   3216 KB   3217 KB   3218 KB   3220 KB   3221 KB   3223 KB   3224 KB   3226 KB   3227 KB   3228 KB   3230 KB   3231 KB   3233 KB   3234 KB   3235 KB   3237 KB   3238 KB   3240 KB   3241 KB   3242 KB   3244 KB   3245 KB   3247 KB   3248 KB   3250 KB   3251 KB   3252 KB   3254 KB   3255 KB   3257 KB   3258 KB   3259 KB   3261 KB   3262 KB   3264 KB   3265 KB   3267 KB   3268 KB   3269 KB   3271 KB   3271 KB             Downloaded: http://repo.getspout.org/org/getspout/spoutpluginapi/dev-SNAPSHOT/spoutpluginapi-dev-20120206.233411-22.jar (3271 KB at 1072.6 KB/sec)
[INFO] 
[INFO] --- maven-resources-plugin:2.4.3:resources (default-resources) @ BunnyDoors ---
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] Copying 3 resources
[INFO] 
[INFO] --- maven-compiler-plugin:2.3.2:compile (default-compile) @ BunnyDoors ---
[INFO] Compiling 2 source files to /Users/jonathana/projects/BunnyDoors/target/classes
[INFO] 
[INFO] --- maven-resources-plugin:2.4.3:testResources (default-testResources) @ BunnyDoors ---
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] skip non existing resourceDirectory /Users/jonathana/projects/BunnyDoors/src/test/resources
[INFO] 
[INFO] --- maven-compiler-plugin:2.3.2:testCompile (default-testCompile) @ BunnyDoors ---
[INFO] No sources to compile
[INFO] 
[INFO] --- maven-surefire-plugin:2.7.2:test (default-test) @ BunnyDoors ---
[INFO] No tests to run.
[INFO] Surefire report directory: /Users/jonathana/projects/BunnyDoors/target/surefire-reports

-------------------------------------------------------
 T E S T S
-------------------------------------------------------
There are no tests to run.

Results :

Tests run: 0, Failures: 0, Errors: 0, Skipped: 0

[INFO] 
[INFO] --- maven-jar-plugin:2.3.1:jar (default-jar) @ BunnyDoors ---
[INFO] Building jar: /Users/jonathana/projects/BunnyDoors/target/BunnyDoors.jar
[INFO] 
[INFO] --- maven-install-plugin:2.3.1:install (default-install) @ BunnyDoors ---
[INFO] Installing /Users/jonathana/projects/BunnyDoors/target/BunnyDoors.jar to /Users/jonathana/.m2/repository/jonnay/bunnydoors/BunnyDoors/0.6.0/BunnyDoors-0.6.0.jar
[INFO] Installing /Users/jonathana/projects/BunnyDoors/pom.xml to /Users/jonathana/.m2/repository/jonnay/bunnydoors/BunnyDoors/0.6.0/BunnyDoors-0.6.0.pom
[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESS
[INFO] ------------------------------------------------------------------------
[INFO] Total time: 11.747s
[INFO] Finished at: Tue Feb 07 20:06:48 MST 2012
[INFO] Final Memory: 10M/81M
[INFO] ------------------------------------------------------------------------
target/BunnyDoors.jar -> ../mineCraftStatus/server/plugins/BunnyDoors.jar
#+end_example



* Giants
  - Helpers at #bukkitdev  
	- esp. ACStache 
  - McMMO devs for providing a decent pom.xml
  - LWC devs, for opening their source
  - Multiverse, for having awesome documentaiton.


